<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd"><HTML><HEAD><TITLE>CompressHTML- Geschichte</TITLE> <META HTTP-EQUIV="Content-Type" CONTENT="text/html;CHARSET=iso-8859-1"><META HTTP-EQUIV="Erstellt" CONTENT="30.01.2000"><META NAME="Content-Language" CONTENT="de"><META NAME="generator" CONTENT="CompressHTML/HTML_Preprozessor"><META NAME="author" CONTENT="Thorsten Willert"><META NAME="publisher" CONTENT="Thorsten Willert"><META NAME="copyright" CONTENT="Thorsten Willert"></HEAD><BODY BGCOLOR="#BBBBBB"><DIV ALIGN=CENTER><TABLE BORDER=0 WIDTH="100%" BGCOLOR="#DDDDDD"><TR><TD ALIGN=RIGHT> <A HREF="Fehler.HTML">[Zur&uuml;ck]</A> <A HREF="ToDo.HTML">[Weiter]</A> </TD></TR></TABLE> <BR CLEAR=ALL><H2>Geschichte</H2> <TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>1997</B> </TD><TD><UL><LI>Erste Version des Programmes mit ReqTools- &quot;Oberfl&auml;che&quot;</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>20 Jan. 1999</B><BR>bis V0.14 </TD><TD><UL><LI>Weiterentwicklung nach einem dummen Verlust (der Komprimierte Code, ohne Kommentare war noch da) des Quellcodes </LI></UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>24 Jan. 1999</B><BR>V0.15 </TD><TD><UL><LI>Kompression deutlich erh&ouml;ht (daf&uuml;r etwas langsamer) </LI> <LI>Diese Dokumentation erstellt </LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>01 Feb. 1999</B><BR>V0.16<BR>Zwischenupdate! </TD><TD><UL><LI>Kleiner Fehler: Ins Archiv 015 ist eine alte Version (014) gelangt</LI> <LI>Fehler bei - Zielverzeichnissen mit Leerzeichen - behoben</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>30-31 Jan. 1999</B><BR>V0.18beta </TD><TD><UL><LI>Triton- Oberfl&auml;che erstellt</LI> <LI>Programm ist nun Modular aufgebaut</LI> <LI>Modul HTMLFaast.rexx auf ca. 30fache! Geschwindigkeit des Original-Programmes optimiert. </LI> <LI>Option eingebaut, die die Datei auf HTML testet</LI> <LI>Option eingebaut, die die Datei auf PRE testet</LI> <LI>Multiselect eingebaut</LI> <LI>Anleitung in mehrere Dateien aufgeteilt</LI> <LI>die rexxMOOS.library mit verwendet</LI> <LI>rexxreqtools wird nicht mehr unterst&uuml;tzt</LI> <LI>Lokalisierung wird erst wieder unterst&uuml;tzt wenn die n&auml;chsten Versionen stabil sind </LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>2-9 Feb. 1999</B><BR>V0.19beta </TD><TD><UL><LI>Oberfl&auml;che optimiert</LI> <LI>Zahl der ausgew&auml;hlten Dateien wird nun angezeigt</LI> <LI>Statusanzeige f&uuml;r Bearbeitung (Datei 1 von n bearbeitet)</LI> <LI>Module werden nur vor dem Berabeiten abgefragt ob sie &lt;PRE&gt; und Dateien &gt;65k unterst&uuml;tzen.Das Programm pr&uuml;ft diese dann vor der &Uuml;bergabe an das Modul automatisch. </LI> <LI>Stopp Funktion eingebaut (kann gleichzeitig als Pause verwendet werden)</LI> <LI>Bearbeitungszeit wird nun angezeigt</LI> <LI>ASL der tritonrexx.library auf ReqTools- der rexxMOOS.library Requester umgestellt</LI> <LI>Zwei Module zur Dekomprimierung! erstellt</LI> <LI>Module nach Stufen umbenannt</LI> <LI>Quell und Zielverzeichnis m&uuml;ssen nun verschieden sein (schon existierende Dateien werden dort &uuml;berschrieben!)</LI> <LI>Gadgets und Eingabefelder werden nun nach dem Starten gesperrt</LI> <LI>F&uuml;r Module ohne eigenen Infotext, wird nun ein Text aus deren INFO-R&uuml;ckgabe und dem Versions-String generiert</LI> <LI>Module werden nun in T: gecacht (sp&auml;ter optional), macht die Ausf&uuml;hrung schneller</LI> <LI>Module werden nun sortiert auf Cycle-Gadget &uuml;bergeben</LI> <LI>Dateien k&ouml;nnen nun, zum Bearbeiten, im RAM gecacht werden (optional)</LI> <LI>Schnittstelle zu den Modulen erweitert</LI> <LI>Module optimiert</LI> <LI>Programmfehler in den Modulen, brechen nun nicht mehr das gesamte Programm ab</LI> <LI>Im Info-Listview wird nun immer der Versionsstring des Moduls mit angezeigt</LI> <LI>Cache-Pfad wird nun an die Module mit &uuml;bergeben, damit diese den nicht selber feststellen m&uuml;ssen (wegen evtl. vorhander Daten-Dateien)</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>10-14 Feb. 1999</B><BR>V0.20beta </TD><TD><UL><LI>Fehler in Cache behoben</LI> <LI>Module optimiert und kleinen Fehler in HTML_Compress_2 entfernt</LI> <LI>Anzahl der Module auf vorerst zwei Kompressions und ein Dekompressionsmodul reduziert</LI> <LI>Kompressionsanzeige wieder eingebaut</LI> <LI>Programm zeigt nun evtl. Fehlerstellen (RC und SIGL) von Modulen an</LI> <LI>Programm auf andere Module (ARexx, AmigaGuide usw.) vorbereitet</LI> <LI>Tooltypes f&uuml;r: Cache-Verzeichnis, Standard-Zielverzeichnis und f&uuml;r die Mindestszahl der zu cachenden Dateien eingebaut</LI> <LI>Dokumentation &uuml;berarbeitet</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>17 Feb. 1999</B><BR>V0.21beta </TD><TD><UL><LI>Programm gegen Fehler in Modulen stabiler gemacht</LI> <LI>Die fehlerhafte Zeile im Modul wird nun gleich mitangezeigt</LI> <LI>Im Falle eines Absturzes wird nun der Cache gel&ouml;scht</LI> <LI>Fehlerroutinen erzeugten ihrerseits Fehler, wenn die Triton- Applikation noch nicht erzeugt war</LI> <LI>Berechung f&uuml;r Kompression erzeugte Fehler, wenn keine Zieldateien erstellt wurden</LI> <LI>Fehler bei Quellverzeichnis Ram Disk: behoben</LI> <LI>Neues Modul erstellt: Einen einfachen HTML- Preprozessor</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>18 Feb. 1999</B><BR>V0.22beta </TD><TD><UL><LI>Informationsabfrage zu den Modulen erweitert</LI> <LI>Alle Module &uuml;berarbeitet</LI> <LI>Kompressionsrate wird nun nur noch bei Kompressions-Modulen angezeigt (erzeugte sonst hin und wieder Fehler)</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>19 Feb.1999</B><BR>V0.23beta </TD><TD><UL><LI>Fehler in Kompressionsberechnung beseitig (vor allem nach Stopp, f&uuml;hrte zum Absturz)</LI> <LI>Dateiencache erheblich verbessert</LI> <LI>Preprozessormodul um #CLI- Befehl erweitert</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>20-21 Feb. 1999</B><BR>V0.24beta </TD><TD><UL><LI>Statistikanzeige etwas verbessert (1 Datei statt 1 Dateien usw.)</LI> <LI>Schnittstelle zu den Modulen nochmals erweitert (um den Ursprungspfad)</LI> <LI>Programmcache an Preprozessoren angepa&szlig;t</LI> <LI>Alle Module &uuml;berarbeitet</LI> <LI>Preprozessor-Modul:</LI> <UL><LI>#INCLUDE- Dateien d&uuml;rfen nun wiederrum Preprozessor Befehle enthalten!</LI> <LI>Der #INCLUDE-Befehl braucht nun nicht mehr den gesamten Pfad. Es gen&uuml;gt der Dateiname. Diese Datei wird dann im "Include" oder "Inc" Verzeichnis im Pfad des HTML- Dokuments gesucht.</LI> <LI>Neuer Befehl: #FILENAME</LI> <LI>!! Die Befehle #SAVEDATE und #SAVETIME in #FILEDATE und #FILETIME umbenannt !!</LI> <LI>Geschwindigkeit gesteigert</LI> </UL></UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>21-23 Feb. 1999</B><BR>V0.26beta </TD><TD><UL><LI>Hoppla die Fehlermeldungen &uuml;ber nicht vorhanden Librarys werden ja nach NIL: geleitet :-)) ...behoben</LI> <LI>Dateityp&uuml;berpr&uuml;fung freigegeben!</LI> <LI>Kleinen Fehler bei Dateiauswahl behoben (Programmfehler wenn man per Hand eine nicht vorhandene Datei eintippt)</LI> <LI>Dokumentation &uuml;berarbeitet (Module auf einzelne Seiten aufgeteilt)</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>24-28 Feb. 1999</B><BR>V0.28beta </TD><TD><UL><LI>Neues Tooltyp: HTMLSCAN: legt die Anzahl der Zeilen fest die bei -Pr&uuml;fe Datei- nach &lt;HTML&gt; durchsucht werden (Mindestens 2)</LI> <LI>Neues Tooltyp: QUITVERIFY: ON = R&uuml;ckfrage bei Beenden</LI> <LI>Neuer Men&uuml;punkt: &Uuml;bernehme Datum: Kopiert Datum und Uhrzeit der Quell- auf die Zieldatei</LI> <LI>Zwei PRE-f&auml;hige Module erstellt, die auch Scripte ber&uuml;cksichtigen.</LI> <LI>Fehler beim Cachen mit Preprozessor behoben</LI> <LI>Fehler beseitigt: Dateigr&ouml;&szlig;e wurde immer &uuml;berpr&uuml;ft</LI> <LI>Fehler in Kompressionsberechnung beseitigt</LI> </UL><UL><LI>Updates von Modulen und Programm, werden in Zukunft getrennt erfolgen!</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>01 Mar. 1999</B><BR>V0.30beta </TD><TD><UL><LI>Fehler beim Setzen der Standardwerten, ohne Icon, behoben</LI> <LI>Fehler bei &quot;&Uuml;bernehme Datum&quot; mit Preprozessor behoben</LI> <LI>Optimierung</LI> <LI>Der Preprozessor wandelt nun (momentan nur deutsche) Umlaute um</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>05-08 Mar. 1999</B><BR>V0.36beta </TD><TD><UL><LI>Ausgaben der Oberfl&auml;che &uuml;berarbeitet</LI> <LI>Fehler im Cache (bei Dateineuauswahl) behoben</LI> <LI>Alle Informationen &uuml;ber Module usw. werden nun beim Programmstart abgefragt (weniger Festplattenzugriffe w&auml;hrend der Laufzeit)</LI> <LI>Module in (wie sonst so &uuml;blich) &quot;Plugins&quot; umbenannt</LI> <LI>Zu allen Modulen k&ouml;nnte nun ein Voreinsteller (momentan noch keiner vorhanden) aufgerufen werden</LI> <LI>Fehler bei nicht vorhandenem Plugin-Verzeichnis behoben</LI> <LI>Programm kann ohne Cache-Verzeichnis nicht mehr gestartet werden!</LI> <LI>Ein Preprozessor kann nun, als Option, vor der Kompression, die Quelldateien bearbeiten (der erste verf&uuml;gbare Preprozessor, zum Dateityp, wird vom Programm ausgew&auml;hlt)</LI> <LI>Kompressoren:</LI> <UL><LI>HTML_Compress_1 und 3 entfernen jetzt auch Leerzeilen</LI> </UL><LI>Preprozessor:</LI> <UL><LI>Die Ersetz-Befehle (#DATE usw.) werden nun erst <I>nach</I> dem Einf&uuml;gen s&auml;mtlicher Inlcude Dateien abgearbeitet, was bei vielen Include-Dateien die Bearbeitung wesentlich beschleunigt.</LI> <LI>nach Vorschl&auml;gen von Christian Schanz die Datumsbefehle, mit Optionen, erweitert</LI> <LI>die Umlautwandlung wieder rausgeworfen (folgt in einem zweiten Preprozessor)</LI> </UL><LI>Dokumentation angepa&szlig;t</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>17 Mar. 1999</B><BR>V0.364beta </TD><TD><UL><LI>Kleinere Korrekturen</LI> <LI>Standard Quellverzeichnis kann nun &uuml;ber Tooltypes bestimmt werden</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>31 Mar. 1999</B><BR>V0.37 </TD><TD><UL><B>Betastatus aufgehoben und ein paar Sch&ouml;nheitskorrekturen:</B> <LI>Fenster beh&auml;lt nun beim Zoomen seine Position bei</LI> <LI>Programmfenster wird nun nach Beendigung des Auftrags nach vorne geholt</LI> <LI>Screentitle zeigt nun bei aktiviertem Fenster den Programmnamen an</LI> <LI>Programmfenster erzeugt nun Busy- Pointer bei offenen Requestern</LI> <LI>Programminfotexte sind nun zentriert</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>16 Apr. 1999</B><BR>V0.38 </TD><TD><UL><LI>Ups, - Stopp versetzte Programm in Dauer- Busy :-)</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>18 Apr. 1999</B><BR>HTML_Compressoren </TD><TD><UL><LI>Zeilenumbr&uuml;che ohne &lt;BR&gt; erzeugen nun bei der Ausgabe keinen Fehler mehr (fehlendes Leerzeichen).</LI><LI>Bei &lt;PRE&gt; werden nun Leerzeichen am Zeilenende entfernt.</LI> </UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>01 Apr. - 18 Apr. 1999</B><BR>Preprozessor </TD><TD><UL><LI>Neuer Befehl:</LI> <UL><LI>#FILESIZE: Ausgabe der Dateigr&ouml;&szlig;e</LI> <LI>#IMGSIZE: Ausgabe der Dimensionen einer Grafik</LI> <LI>#HTMLCODE / #ENDHTMLCODE: HTML-Code wird in diesem Bereich lesbar ausgegeben</LI> <LI>#DEFINE: Macros mit oder ohne Variablen&uuml;bergabe</LI> <LI>#IFDEF / #IFNDEF / #ELSE / #ENDIF: Kontrollstrukturen mit #DEFINE erstellten Bezeichnern</LI> </UL><LI>Pfadangabe nun wie in HTML, relativ zur aktuellen Datei m&ouml;glich (../../Bilder/Bild1.PNG)</LI> <LI>(Beispiel-) Include- Dateien beigef&uuml;gt</LI> </UL></TD></TR></TABLE><BR><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>07 Nov. 1999</B> </TD><TD><UL><LI>Schnittstelle zu den Modulen verkleinert d.h. es werden <I>keine</I> HTML-Module ohne PRE-ber&uuml;cksichtigung, und keine Module mit 65k-Grenze mehr unterst&uuml;tzt.</LI><LI>Das Datum wird nun grunds&auml;tzlich von der Original-Datei &uuml;bernommen.</LI> <LI>Statusanzeige verbessert: Die zu bearbeitende Datei wird nun immer komplett angezeigt (der Pfad wird nun vor der Datei verk&uuml;rtzt.</LI><LI>Die beiden einfachen Kompressoren HTML-Compress_1 und 2 werden in der bisherigen Form <B>nicht</B> mehr unterst&uuml;tzt. Neue liegen bei!</LI> <LI><B>Neuer Preprozessor-Befehl:</B></LI> <UL><LI>#SORT und #ENDSORT: Damit k&ouml;nnen Zeilen im Dokument sortiert werden (optional nach URL's oder den dazugeh&ouml;rigen LINKS)</LI></UL></UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>10 Nov. 1999</B> </TD><TD><UL><LI><B>CompressHTML</B> V0.41</LI> <UL><LI>Fehler beim &Uuml;berspringen/Ignorieren, beim Pr&uuml;fen des Dateitypes beseitigt.</LI> <LI>Folgefehler davon: Eine Rechenfehler bei der Kompressionsermittlung - korrigiert.</LI> </UL><LI><B>Neues:</B></LI> <UL><LI>Das Pattern, der Dateiauswahl, wird anhand des Plugin-Types eingestellt.</LI> <LI>Pattern Vorwahl &uuml;ber Tool-Types m&ouml;glich.</LI> <LI><B>Neues Plugin:</B></LI> <UL><LI>Amiga-Guide Compressor.</LI> <LI>Universeller- Preprozessor (beta).</LI> </UL></UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>03 Dez. 1999</B> </TD><TD><UL><LI><B>HTML_Preprozessor_D Neues:</B></LI> <UL><LI>#FILEDATE und #DATE k&ouml;nnen nun Tages und Monatsangaben ein-, oder zweistellig ausgeben.</LI><LI>Bei #SORT kann nun statt HREF auch URL angegeben werden.</LI> </UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>05 Dez. 1999</B> </TD><TD><UL><LI><B>CompressHTML:</B> V0.45</LI> <UL><LI>Programm ben&ouml;tigt nun zus&auml;tzlich die rexxlocaldates.library.</LI> <LI>Programmoberfl&auml;che &uuml;berarbeitet und verkleinert.</LI> <LI>Plugininformation wird nun in einem anderen Fenster angezeigt.</LI> <LI>Neues TOOLTYPE, ob das Hauptfenster, als Fertigmeldung, nach vorne kommen soll.</LI> <LI>Dateityppr&uuml;fung verbessert, &uuml;ber die datatypes.library.</LI> </UL><LI><B>HTML_Preprozessor_D:</B></LI> <UL><LI>Optionen von #DATE und #FILEDATE erweitert.</LI> <LI>#DATE und #FILEDATE geben nun lokalisierte Angaben aus (vorher nur deutsch).</LI> <LI>#FILENAME um die Optionen PATH und FULL erweitert.</LI> </UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>05 Dez. 1999</B> </TD><TD><UL><LI><B>CompressHTML:</B> V0.50</LI> <UL><LI>Kleine Projektverwaltung integriert. Diese speichert Quell-, Zielverzeichniss und die Bearbeitungsmethode (vorerst).</LI><LI>Ge&auml;nderte Dateien k&ouml;nnen nun &uuml;ber das Archiv-Bit automatisch ausgew&auml;hlt werden.</LI></UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>05 Dez.- 30 Dez. 1999</B> </TD><TD><UL><LI>Version 0.50:</LI> <UL><LI>Kleine Projektverwaltung integriert.</LI> <LI>Dateien k&ouml;nnen anhand des Archiv-Bits automatisch selektiert werden.</LI> </UL><LI>Version 0.501:</LI> <UL><LI>Kleinere Sch&ouml;nheitskorrekturen (Oberfl&auml;che).</LI> </UL><LI>Version 0.51:</LI> <UL><LI>Die Einstellungen des Options-Men&uuml;s, werden nun mit jedem Projekt gespeichert.</LI> <LI>Den &quot;Stopp&quot;-Button und einen Teil der Statusanzeige durch eine Fortschrittsanzeige ersetzt.</LI><LI>Das Plugin-Info-Fenster kann nun st&auml;ndig ge&ouml;ffnet bleiben.</LI> <LI>Unterbrechungssignale vor dem Initalisieren der Oberfl&auml;che f&uuml;hren nun nicht mehr zu Fehlermeldungen.</LI><LI>Mehrere kleine Fehler behoben.</LI> </UL><LI>Version 0.60:</LI> <UL><LI>Die Oberfl&auml;che hat eine neues Design bekommen ... :-) </LI> <LI>Intern komplett &uuml;berarbeitet. <LI>Die Plugins k&ouml;nnen nun in beliebiger Menger, Reihenfolge, mit internen Funktionen verschalten und abgearbeitet werden.</LI></UL><LI>Version 0.601:</LI> <UL><LI>Eine Abfrage, beim Entfernen eines Moduls aus der Liste, eingebaut.</LI> <LI>Die Module k&ouml;nnen nun in der Liste einzeln Ein,- und ausgeschalten werden.</LI> <LI>Die Requester der Sicherheitsabfragen k&ouml;nnen nun nicht mehr mit RETURN bet&auml;tigt werden.</LI> <LI>Die interne Funktion CHECK_FILETYPE macht nun nach der R&uuml;ckfrage das Richtige</LI> <LI>Im Falle eines Fehlers, werden nun wirklich alle Fenster geschlossen.</LI> <LI>Interne Optimierungen.</LI> </UL><LI>Version 0.602:</LI> <UL><LI>Sorry, aber die Projektdateien sind nun etwas inkompatibel zu den bisherigen Versionen.</LI> <LI>Das Namensmuster kann nun f&uuml;r jedes Projekt mitgesichert werden.</LI> <LI>Bei der Funktionsauswahl kann die aktuelle Funktion in der Liste jetzt direkt ersetzt werden.</LI> <LI>Mit dem TOOLTYPE: <B>TEMPLATE=</B> kann man jetzt ein Vorlageprojekt angeben, das &uuml;ber den Men&uuml;punkt: <B>Projekt:Neu von Vorlage ...</B> geladen wird.</LI> <LI>&Uuml;ber den Men&uuml;punkt <B>Projekt:Neu</B>, wird die Oberfl&auml;che zur&uuml;ckgesetzt.</LI> <LI>Die Funktionen CLONE_SRCDIR und CHECK_FILETYPE arbeiten nun korrekt.</LI> <LI>Neue Funktion: AUTO_SELECT macht das selbe wie das Gadget <B>Automatisch</B>, daf&uuml;r mu&szlig; man damit jetzt aber nur noch auf Start dr&uuml;cken :-)</LI><LI>Neue Funktion: CHECK_FILETYPE_AUTO, selbe Wirkung wie CHECK_FILETYPE, nur das nicht passende Dateien ohne R&uuml;ckfrage kopiert werden.</LI><LI>Beim Entfernen einer Funktion aus der Liste, erfolgt nun eine R&uuml;ckfrage.</LI> <LI>Mehrere Fehler behoben.</LI> <LI>Kurzbeschreibung zu den internen Funktionen erstellt (diese haben ihre Info-Texte auch im Plugin-Verzeichnis)</LI> </UL><LI>Version 0.603:</LI> <UL><LI>Oberfl&auml;che wieder etwas verkleinert.</LI> <LI>Ein paar kleinere Eigenheiten behoben.</LI> <LI>Die Funktionsauswahl merkt sich nun die zuletzt gew&auml;hlte Liste, nach schlie&szlig;en des Fensters.</LI> <LI>Neue Funktionen werden nun nicht mehr ans der Liste sondern vor die Cursorposition gesetzt.</LI> <LI>Dokumentation angepa&szlig;t.</LI> </UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>03 Jan. 2000</B></TD> </TD><UL><LI>Version 0.604b</LI> <UL><LI>Fehler in Funktion <CODE>BUFFER_TO_CACHE</CODE> behoben: Erzeugte einen Fehler, wenn man ein davorstehendes Plugin inaktivierte, dann konnte das darauffolgende keine Dateien mehr &ouml;ffnen.</LI><LI>ToolType <CODE>TOFRONT</CODE> geht wieder :-)</LI> <LI>Alle Fenster, die am Programmende offen waren, werden beim n&auml;chsten Start wieder ge&ouml;ffnet (leider str&auml;ubt sich Triton das auch an der angegebenen Position zu tun, reagiert leider nur auf horiztontale Positionsangaben :-( ... )</LI></UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR><TD WIDTH=100 VALIGN=TOP><B>05 Jan. 2000</B></TD> <TD><UL><LI>Version 0.605b</LI> <UL><LI>Die beiden Buttons f&uuml;rs Ein bzw. Ausschalten einer Funktion, durch einen ersetzt.</LI> <LI>Oberfl&auml;che &uuml;berarbeitet (Shortcuts).</LI> <LI>ToolTypes:</LI> <UL><LI><B>NEU:</B><CODE> P_FONT=x:</CODE> F&uuml;r die Proportional-Schrift der Fenster.</LI> <LI><B>NEU:</B><CODE> P_SIZE=n:</CODE> Die Gr&ouml;&szlig;e der Proportional-Schrift.</LI> <LI><B>NEU:</B><CODE> F_FONT=x:</CODE> Schrift mit fester-Weite (Listen).</LI> <LI><B>NEU:</B><CODE> F_SIZE=x:</CODE> Gr&ouml;&szlig;e f&uuml;r die Schrift mit fester-Weite.</LI> <LI><B>NEU:</B> Es kann nun bis zu 10mal <CODE>TEMPLATE=x</CODE> eingetragen werden, diese Vorlagen werden dann im Men&uuml; angezeigt.</LI><LI><B>NEU:</B> Wird bei <CODE>DEFPROJECT=</CODE> statt einem Projekt - <CODE>PREV</CODE> eingetragen, wird immer das zuletzt Bearbeitete geladen. </UL></UL></TD></TR></TABLE><TABLE WIDTH="90%" BORDER=0 CELLSPACING=0><TR BGCOLOR="#CCCCCC"><TD WIDTH=100 VALIGN=TOP><B>06 Jan. 2000</B></TD> <TD><LI>Version 0.606b</LI> <UL><LI>Die Oberffl&auml;che etwas ge&auml;ndert (wegen evtl. anderer Schriftgr&ouml;&szlig;en).</LI> <LI>Das Vorlagen-Men&uuml; wird nun ganz weggelassen, falls keine Vorlagen angegeben worden sind.</LI> <LI>Dokumentation und Beispiele &uuml;berarbeitet.</LI> </UL></UL></TD></TR></TABLE><BR CLEAR=ALL><TABLE BORDER=0 WIDTH="100%" BGCOLOR="#DDDDDD"><TR><TD ALIGN=RIGHT> <A HREF="Fehler.HTML">[Zur&uuml;ck]</A> <A HREF="ToDo.HTML">[Weiter]</A> </TD></TR></TABLE> <BR CLEAR=ALL></DIV><HR><DIV ALIGN=RIGHT><FONT SIZE=-1><I>30.&nbsp;Januar&nbsp;2000</I></FONT> </DIV></BODY></HTML>